{"name":"Backend Development","postlist":[{"title":"Java Thread Context: How to Determine Whether You're in a Request Context","slug":null,"date":"2023-03-04T11:14:00.000Z","updated":"2023-03-04T11:14:00.000Z","comments":null,"path":"api/articles/release/Java-Thread-Context-Request-Context.json","excerpt":"IntroductionWhen developing Java web applications, it is often necessary to check whether the current thread is in a request context. A request context is a context that holds information about a single HTTP request and is typically used in web applications. In this blog post, we will explore how to determine whether the current thread is in a request context using Spring Framework’s RequestContextHolder class. The RequestContextHolder ClassThe RequestContextHolder class is a utility class provi","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Retrieve User Addresses in a Spring Boot Application","slug":null,"date":"2023-03-04T12:14:00.000Z","updated":"2023-03-04T12:14:00.000Z","comments":null,"path":"api/articles/release/get-ip-from-request.json","excerpt":"When building a web application, it’s often necessary to retrieve the IP address of the user who is accessing the application. This information can be useful for various purposes, such as security, analytics, and customization. In this tutorial, we will explore how to retrieve both IPv4 and IPv6 addresses of a user in a Spring Boot application. Retrieving User IP AddressIn Spring Boot, we can retrieve the IP address of a user by injecting a HttpServletRequest object into our controller class and","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Install a Specific Version of Docker on CentOS","slug":null,"date":"2023-05-02T21:02:00.000Z","updated":"2023-05-03T09:02:00.000Z","comments":null,"path":"api/articles/release/install-docker.json","excerpt":"Docker is a popular containerization technology that allows you to quickly create, deploy, and run applications. However, sometimes you may need to install a specific version of Docker instead of the latest version. In this article, we’ll walk you through the steps to install a specific version of Docker on CentOS. Step 1: Install Necessary PackagesFirst, you need to install some necessary packages, including yum-utils, device-mapper-persistent-data, and lvm2. These packages will help you config","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Execute JavaScript Code and Functions in Java","slug":null,"date":"2023-03-16T12:38:00.000Z","updated":"2023-03-16T12:38:00.000Z","comments":null,"path":"api/articles/release/java-exute-js.json","excerpt":"JavaScript is a popular scripting language used for developing dynamic and interactive web pages. While JavaScript is primarily used in web development, it can also be used in other areas such as server-side scripting, desktop applications, and mobile apps. In this blog, we will explore how to execute JavaScript code and functions in Java. To execute JavaScript code in Java, we can use the ScriptEngine class provided by the Java API. The ScriptEngine class is used to execute scripts written in v","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Get Log4j Log File Path in Java","slug":null,"date":"2023-03-20T22:02:00.000Z","updated":"2023-03-20T22:02:00.000Z","comments":null,"path":"api/articles/release/log4j-get-log-path.json","excerpt":"IntroductionLog4j is one of the widely used logging tools on the Java platform. It allows configuration of logging output to various destinations, such as console, file, and database. In real-world applications, it is often necessary to obtain the file path of the Log4j log file for viewing, analysis, and processing purposes. In this blog, we will discuss a method to obtain the Log4j log file path using Java code. Code exampleIn Log4j, a Logger instance can be used to get all of its Appenders us","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null}]}