{"total":13,"pageSize":10,"pageCount":2,"data":[{"title":"RemoteFingerUnlock FAQ","slug":null,"date":"2025-08-23T04:33:04.282Z","updated":"2025-08-23T04:33:04.282Z","comments":null,"path":"api/articles/release/rfu/FAQ.json","excerpt":"Contact Us:Discord: https://discord.gg/b5fMzvdmeX (Recommended) Or leave your comments and suggestions in the comments section at the end of the article. Frequently Asked Questions:1. No response on the lock screen? Can’t connect?The new version does not display the unlock result on the lock screen, but returns it through an API. You can see it when you call the API. The API documentation can be found on the official website. The inability to connect may be a firewall issue. You can try to disab","keywords":null,"cover":"/posts/31496/image-20250822013555071.png","content":null,"raw":null,"categories":null,"tags":null},{"title":"RemoteFingerUnlock API Documentation","slug":null,"date":"2025-08-21T22:14:19.000Z","updated":"2025-08-21T22:14:19.000Z","comments":null,"path":"api/articles/release/rfu/api-doc.json","excerpt":"Remote Unlock API DocumentationVersion: 1.0 This document is the official API reference for the Remote Unlock Module. It provides detailed information for all available endpoints, including authentication methods, request parameters, and expected response formats. Terms of Service: https://rfu.czqu.net DisclaimerThe information provided by this [Website/Document/Service/Product] (hereinafter “the Service”) is for general informational purposes only. All information is provided in good faith, how","keywords":null,"cover":"https://github.githubassets.com/images/icons/emoji/unicode/2705.png?v8","content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Install a Specific Version of Docker on CentOS","slug":null,"date":"2023-05-02T21:02:00.000Z","updated":"2023-05-03T09:02:00.000Z","comments":null,"path":"api/articles/release/install-docker.json","excerpt":"Docker is a popular containerization technology that allows you to quickly create, deploy, and run applications. However, sometimes you may need to install a specific version of Docker instead of the latest version. In this article, we’ll walk you through the steps to install a specific version of Docker on CentOS. Step 1: Install Necessary PackagesFirst, you need to install some necessary packages, including yum-utils, device-mapper-persistent-data, and lvm2. These packages will help you config","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Get Log4j Log File Path in Java","slug":null,"date":"2023-03-20T22:02:00.000Z","updated":"2023-03-20T22:02:00.000Z","comments":null,"path":"api/articles/release/log4j-get-log-path.json","excerpt":"IntroductionLog4j is one of the widely used logging tools on the Java platform. It allows configuration of logging output to various destinations, such as console, file, and database. In real-world applications, it is often necessary to obtain the file path of the Log4j log file for viewing, analysis, and processing purposes. In this blog, we will discuss a method to obtain the Log4j log file path using Java code. Code exampleIn Log4j, a Logger instance can be used to get all of its Appenders us","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Execute JavaScript Code and Functions in Java","slug":null,"date":"2023-03-16T12:38:00.000Z","updated":"2023-03-16T12:38:00.000Z","comments":null,"path":"api/articles/release/java-exute-js.json","excerpt":"JavaScript is a popular scripting language used for developing dynamic and interactive web pages. While JavaScript is primarily used in web development, it can also be used in other areas such as server-side scripting, desktop applications, and mobile apps. In this blog, we will explore how to execute JavaScript code and functions in Java. To execute JavaScript code in Java, we can use the ScriptEngine class provided by the Java API. The ScriptEngine class is used to execute scripts written in v","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to make braised pork trotters","slug":null,"date":"2023-03-12T09:18:00.000Z","updated":"2023-03-12T09:18:00.000Z","comments":null,"path":"api/articles/release/how-to-make-braised-pork-trotters.json","excerpt":"Braised pork trotters are a beloved dish in many Asian cuisines. It’s a rich, flavorful, and comforting dish that’s perfect for cold days or for any occasion. In this recipe, we’ll go through the steps of making a simple and delicious braised pork trotters dish. Ingredients 4 pork trotters 10g ginger slices 50ml Shaoxing wine 50ml light soy sauce 25ml dark soy sauce 20g rock sugar 2 star anise 1 piece cinnamon bark 2 bay leaves Salt to taste Water Instructions Clean the pork trotters: Rinse the ","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"How to Retrieve User Addresses in a Spring Boot Application","slug":null,"date":"2023-03-04T12:14:00.000Z","updated":"2023-03-04T12:14:00.000Z","comments":null,"path":"api/articles/release/get-ip-from-request.json","excerpt":"When building a web application, it’s often necessary to retrieve the IP address of the user who is accessing the application. This information can be useful for various purposes, such as security, analytics, and customization. In this tutorial, we will explore how to retrieve both IPv4 and IPv6 addresses of a user in a Spring Boot application. Retrieving User IP AddressIn Spring Boot, we can retrieve the IP address of a user by injecting a HttpServletRequest object into our controller class and","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"Java Thread Context: How to Determine Whether You're in a Request Context","slug":null,"date":"2023-03-04T11:14:00.000Z","updated":"2023-03-04T11:14:00.000Z","comments":null,"path":"api/articles/release/Java-Thread-Context-Request-Context.json","excerpt":"IntroductionWhen developing Java web applications, it is often necessary to check whether the current thread is in a request context. A request context is a context that holds information about a single HTTP request and is typically used in web applications. In this blog post, we will explore how to determine whether the current thread is in a request context using Spring Framework’s RequestContextHolder class. The RequestContextHolder ClassThe RequestContextHolder class is a utility class provi","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null},{"title":"Wireshark Basic Usage","slug":null,"date":"2023-03-04T00:56:00.000Z","updated":"2023-03-04T00:56:00.000Z","comments":null,"path":"api/articles/release/2020-4-1-basic use of wireshark.json","excerpt":"一、IntroductionWireshark is currently one of the most widely used network packet analysis software in the world. The function of network packet analysis software is to listen to network packets and display the most detailed network packet information as much as possible. Wireshark uses Winpcap as the interface to directly exchange data packets with the network card. The following figure shows the initial interface after successfully installing Winpcap and Wireshark: In the initial interface of Wi","keywords":null,"cover":"/posts/20069/image-20200608181205658.png","content":null,"raw":null,"categories":null,"tags":null},{"title":"The issue of SSL certificate being unable to issue due to the CNAME record pointing to Vercel affecting the CAA record.","slug":null,"date":"2023-03-04T00:14:00.000Z","updated":"2023-03-05T07:36:00.000Z","comments":null,"path":"api/articles/release/vercel导致的SSL证书无法签发的问题_en.json","excerpt":"SolutionThe most drastic solution is to directly pause all DNS related to Vercel.Or, first pause the resolution of the second-level domain to Vercel, that is, pause example.com-&gt;Vercel,and then pause the Vercel of the affected subdomain, that is, pause a.example.com-&gt;Vercel. ProblemToday, Alibaba Cloud informed me that an SSL certificate for one of my domains was about to expire. As an experienced developer, I opened the Alibaba Cloud console to apply for a new certificate. However, someth","keywords":null,"cover":null,"content":null,"raw":null,"categories":null,"tags":null}]}